# <div align="center">SERIES</div>

In [1]:
import numpy as np
import pandas as pd

In [10]:
a=['a','b','c','d','e']
d=['a','b','c','d','e']
b=[1,2,3,4,5]
c={1:'a',2:'b',3:'c',4:'d',5:'e'}

In [12]:
x=pd.Series(b,a)
y=pd.Series(b,d)

In [23]:
z=x+y
type(z)

pandas.core.series.Series

In [30]:
print(z[:'c'])

a    2
b    4
c    6
dtype: int64

In [31]:
print(z['c'])

6

# <div align='center'>DATAFRAMES</div>

In [49]:
a=[1,2,3,4,5]
b=[0,2,4,6,8]
c=[1,3,5,7,9]
d=[0,1,2,3,4]

In [50]:
df=pd.DataFrame([a,b,c,d],['a','b','c','d'],['p','q','x','y','z'])

In [51]:
df

   p  q  x  y  z
a  1  2  3  4  5
b  0  2  4  6  8
c  1  3  5  7  9
d  0  1  2  3  4

In [52]:
df['s']=df['y']+df['z']   #adding the column

In [53]:
df

   p  q  x  y  z   s
a  1  2  3  4  5   9
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [54]:
df.drop('a') #to delete the row temporarily

   p  q  x  y  z   s
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [47]:
df.drop('a',inplace=True)  #to delete the row a permanently

   p  q  x  y  z   s
b  0  2  4  6  8  14
c  1  3  5  7  9  16
d  0  1  2  3  4   7

In [55]:
df.drop('s',axis=1,inplace=True)  #to delete the column permanently

In [56]:
df

   p  q  x  y  z
a  1  2  3  4  5
b  0  2  4  6  8
c  1  3  5  7  9
d  0  1  2  3  4

In [57]:
df['z']   #to access the elements of column z

a    5
b    8
c    9
d    4
Name: z, dtype: int64

In [58]:
df.loc['a'] #to access the elements of  row a

p    1
q    2
x    3
y    4
z    5
Name: a, dtype: int64

In [63]:
df.iloc[0]  #to access the elements of  row by index number

p    1
q    2
x    3
y    4
z    5
Name: a, dtype: int64

In [65]:
df.loc['a','z']  #to access the element of specific row and specific column

5